Autodesk.Navisworks.Api.Document
Represents the contents of one or more loaded files.

Autodesk.Navisworks.Api.Document.ActiveSheet
Gets current active sheet

Autodesk.Navisworks.Api.Document.ActiveSheetChanged
Occurs when the ActiveSheet has changed.

Autodesk.Navisworks.Api.Document.ActiveSheetChanging
Occurs when the ActiveSheet is about to change.

Autodesk.Navisworks.Api.Document.ActiveSheetType
Gets current active sheet type

Autodesk.Navisworks.Api.Document.ActiveView
Gets a reference to the currently active View

Autodesk.Navisworks.Api.Document.ActiveViewChanged
Occurs when the ActiveView has changed

Autodesk.Navisworks.Api.Document.ActiveViewChanging
Occurs when the ActiveView is about to change

Autodesk.Navisworks.Api.Document.Alignments
Gets a DocumentAlignments object containing the Civil Alignment data.

Autodesk.Navisworks.Api.Document.AppendFile(System.String)
Append file with files already in document, adding to current contents.
fileName: Path to try and append file from
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to append file

Autodesk.Navisworks.Api.Document.AppendFiles(System.Collections.Generic.IEnumerable{System.String})
Append files with files already in document, adding to current contents. More efficient than
appending each file separately.
fileNames: Paths to append files from
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to append files

Autodesk.Navisworks.Api.Document.AppendSheet(Autodesk.Navisworks.Api.SheetInfo)
Append contents of sheet to current active sheet.
sheet: SheetInfo to try and append sheet from
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to append sheet
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.BeginTransaction(System.String)
Returns a new Transaction object. This is used to
batch together edits. In the future it may support rollback.
displayName:
String that may be displayed in the GUI for undoing this transaction.
Returns:
New Transaction object.

Autodesk.Navisworks.Api.Document.CanDescribeAsAggregate
Determines if current contents can described in terms of an JSON AggregateModelDefinition object.
Returns:
false if current contents cannot be described as an aggregate.

Autodesk.Navisworks.Api.Document.Clash
Gets the associated DocumentClash part as discoverable IDocumentClash

Autodesk.Navisworks.Api.Document.Clear
Delete entire contents of document, returning to default (untitled, empty) state.

Autodesk.Navisworks.Api.Document.CloseFileHandles
Closes all file handles for currently loaded files, completing load for current sheet.
File handles may be reopened in future (e.g. when changing the active sheet).
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to close file handles

Autodesk.Navisworks.Api.Document.ConvertSheet(System.String)
Convert sheet with sheetId.
sheetId: Id of sheet to convert
Throws System.ArgumentException:
Argument 'sheetId' is not contained in current document.
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to convert

Autodesk.Navisworks.Api.Document.CreateCommentWithUniqueId(System.String,Autodesk.Navisworks.Api.CommentStatus)
Create a Comment with an Id that is unique within this Document

Autodesk.Navisworks.Api.Document.CreateCommentWithUniqueId(System.String,Autodesk.Navisworks.Api.CommentStatus,System.String)
Create a Comment with an Id that is unique within this Document

Autodesk.Navisworks.Api.Document.CurrentComments
Gets a DocumentCurrentComments object containing the current Comments data.

Autodesk.Navisworks.Api.Document.CurrentFileName
Current file name.  Different from suggested file name in that
SuggestedFileName will return a friendly name for a remote file on
the basis that it expects you are trying to save locally and will
return a "Untitled" name for files that aren't saved yet.

Autodesk.Navisworks.Api.Document.CurrentMeasurement
Gets a DocumentCurrentMeasurement object containing the current measurement data.

Autodesk.Navisworks.Api.Document.CurrentSearch
Gets a DocumentSearch object containing the current search.

Autodesk.Navisworks.Api.Document.CurrentSelection
Gets a DocumentCurrentSelection object containing the current selection.

Autodesk.Navisworks.Api.Document.CurrentViewpoint
Gets a DocumentCurrentViewpoint object containing the current Viewpoint data.

Autodesk.Navisworks.Api.Document.Database
Gets a DocumentDatabase object containing embedded database.

Autodesk.Navisworks.Api.Document.DescribeAsAggregate
Describes current contents in terms of an JSON AggregateModelDefinition object.
Throws Autodesk.Navisworks.Api.DocumentFileException:
Current contents cannot be described as an aggregate.

Autodesk.Navisworks.Api.Document.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.

Autodesk.Navisworks.Api.Document.Dispose(System.Boolean)


Autodesk.Navisworks.Api.Document.DocumentInfo
Gets DocumentInfoPart

Autodesk.Navisworks.Api.Document.EndDisableUndo
Decrements an internal counter that determines if the undo mechanism is disabled.
As the count goes from 1 to 0 Undo is re-enabled. Should be used with a matched
call to StartDisableUndo.

Autodesk.Navisworks.Api.Document.ExportAsDwf(System.String)
Exports the document as a 'DWF' file.

Autodesk.Navisworks.Api.Document.ExportToNwd(System.String,Autodesk.Navisworks.Api.NwdExportOptions)
Exports contents of document to an NWD file..
fileName: Path to try and publish file to
options: Options to export file with
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to export file
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.FileName
File name (or URL) for document. May be null if document is
empty or has no associated file name.

Autodesk.Navisworks.Api.Document.FileNameChanged
Occurs when the file name of the Document is changed.

Autodesk.Navisworks.Api.Document.FileSaved
Occurs when the document has been saved into a file

Autodesk.Navisworks.Api.Document.FileSaving
Occurs when the document is about to be saved into a file

Autodesk.Navisworks.Api.Document.FilesUpdated
Occurs when the document has updated files.

Autodesk.Navisworks.Api.Document.FilesUpdating
Occurs when the document is about to update files.

Autodesk.Navisworks.Api.Document.FileVersion
Current file version for document.

Autodesk.Navisworks.Api.Document.FrontRightTopViewUpVector
Returns view direction up vector to look at model from front-right-top direction.

Autodesk.Navisworks.Api.Document.FrontRightTopViewVector
Returns view direction to look at model from front-right-top direction.

Autodesk.Navisworks.Api.Document.FrontVector
Natural front vector for this model. Will be Zero if no front vector defined.

Autodesk.Navisworks.Api.Document.GenerateImage(Autodesk.Navisworks.Api.ImageGenerationStyle,System.Int32,System.Int32,System.Boolean)
Generates an Image for this Document.

Autodesk.Navisworks.Api.Document.GenerateImage(Autodesk.Navisworks.Api.ImageGenerationStyle,System.Int32,System.Int32,System.Double,System.Boolean)
Generates an Image for this Document.

Autodesk.Navisworks.Api.Document.GetBoundingBox(System.Boolean)
Returns the bounding box for the entire document.
ignoreHidden:
If true, bounding box will not include hidden items, otherwise hidden items will be taken into account.
Returns:
Bounding box for all items in the document.

Autodesk.Navisworks.Api.Document.GetPointInfo(Autodesk.Navisworks.Api.Point3D)
Returns information relevant to the specified point.
worldPoint: A 3D point in the world
Returns:
A list of PointInfo objects related to the world point.

Autodesk.Navisworks.Api.Document.Grids
Gets a DocumentGrids object containing the Grids data.

Autodesk.Navisworks.Api.Document.HomeView
The home view for the current document (if one is defined).

Autodesk.Navisworks.Api.Document.Hyperlinks
Gets a DocumentHyperlinks object containing document hyperlinks.

Autodesk.Navisworks.Api.Document.IsActiveTransaction
Is there a transaction in progress ?

Autodesk.Navisworks.Api.Document.IsClear
Is document in its default (untitled, empty) state ?

Autodesk.Navisworks.Api.Document.IsDisposed
Has this document been disposed ?

Autodesk.Navisworks.Api.Document.IsModified
Returns true if modifications requiring a save have been performed

Autodesk.Navisworks.Api.Document.IsUndoDisabled
Gets the disabled state of the Undo mechanism.
Returns: True if Undo mechanism is currently disabled, otherwise false.

Autodesk.Navisworks.Api.Document.MergeFile(System.String)
Merge file into document, merging with current contents, ignoring duplicates.
fileName: Path to try and merge file from
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to merge file

Autodesk.Navisworks.Api.Document.MergeFiles(System.Collections.Generic.IEnumerable{System.String})
Merge files with files already in document, merging with current contents. More efficient than
merging each file separately.
fileNames: Paths to merge files from
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to merge files

Autodesk.Navisworks.Api.Document.MergeSheet(Autodesk.Navisworks.Api.SheetInfo)
Merge contents of sheet to current active sheet, ignoring duplicates.
sheet: SheetInfo to try and merge sheet from
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to merge sheet
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.Models
Gets a DocumentModels object containing the current list of Models.

Autodesk.Navisworks.Api.Document.NextRedo
Display name of transaction that will be redone next time Redo() is called.
Returns: Null if nothing can be redone

Autodesk.Navisworks.Api.Document.NextUndo
Display name of transaction that will be undone next time Undo() is called.
Returns: Null if nothing can be undone

Autodesk.Navisworks.Api.Document.OpenAggregate(System.String,System.String)
Loads aggregate into document, replacing current contents.
aggregateJson: Aggregate in the form of a JSON AggregateModelDefinition object.
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to open aggregate.

Autodesk.Navisworks.Api.Document.OpenFile(System.String)
Load file into document, replacing current contents.
fileName: Path to try and load file from
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to open file

Autodesk.Navisworks.Api.Document.PublishFile(System.String,Autodesk.Navisworks.Api.NwdExportOptions,Autodesk.Navisworks.Api.PublishProperties)
Publish contents of document to a file.
fileName: Path to try and publish file to
properties: Publishing properties to publish file with
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to publish file
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.Redo
Redoes the last completed transaction and makes it available for Undo again.
Throws System.InvalidOperationException:
No transaction is available to Redo or there is an active transaction in progress.

Autodesk.Navisworks.Api.Document.RemoveFile(System.Int32)
Remove the file with the provided index from the document.
index: Index of the file to remove from the document
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to remove the file

Autodesk.Navisworks.Api.Document.ResolveReference(Autodesk.Navisworks.Api.SavedItemReference)
Finds an item specified by the reference within this document.
Returns: Null if the item can't be found.
Throws System.ArgumentException:
reference does not refer to a specific part (documentPartId is empty/null).
Throws System.ArgumentNullException:
if reference is null.

Autodesk.Navisworks.Api.Document.RightVector
Natural right vector for this model. Will be Zero if no right vector defined.

Autodesk.Navisworks.Api.Document.Rollback
Rolls back (undoes) the last completed transaction. It will not be available for Redo.
Throws System.InvalidOperationException:
No transaction is available to Undo or there is an active transaction in progress.

Autodesk.Navisworks.Api.Document.SavedViewpoints
Gets a DocumentCurrentViewpoint object containing the current Viewpoint data.

Autodesk.Navisworks.Api.Document.SaveFile(System.String)
Save contents of document to a file.
fileName: Path to try and save file to
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to save file
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.SaveFile(System.String,Autodesk.Navisworks.Api.DocumentFileVersion)
Save contents of document to a file using a specific file version.
fileName: Path to try and save file to
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to save file
Throws System.InvalidOperationException:
Document IsClear
Throws System.ArgumentException:
fileName does not have .nwd or .nwf extension

Autodesk.Navisworks.Api.Document.SelectionSets
Gets the SelectionSets stored in the document.

Autodesk.Navisworks.Api.Document.SetActiveSheet(System.String)
Switch to the sheet with Id sheetId.
sheetId: Id of sheet to make active
Throws System.ArgumentException:
Argument 'sheetId' is not contained in current document.
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to load sheet

Autodesk.Navisworks.Api.Document.SetGraduatedBackground(Autodesk.Navisworks.Api.Color,Autodesk.Navisworks.Api.Color)
Sets a graduated background.

Autodesk.Navisworks.Api.Document.SetHorizonBackground(Autodesk.Navisworks.Api.Color,Autodesk.Navisworks.Api.Color,Autodesk.Navisworks.Api.Color,Autodesk.Navisworks.Api.Color)
Sets a horizon background.

Autodesk.Navisworks.Api.Document.SetPlainBackground(Autodesk.Navisworks.Api.Color)
Sets a plain background.

Autodesk.Navisworks.Api.Document.ShowMatchingItemInSheet(System.String,Autodesk.Navisworks.Api.ModelItem)
Search for items with same guid in item, if have, make the sheet with sheetId active,
and select the matching model items.
sheetId: Id of sheet to search in
item: ModelItem to search with same Guid
Throws System.ArgumentNullException:
item is null.
Throws System.ArgumentException:
Argument 'sheetId' is not contained in current document.

Autodesk.Navisworks.Api.Document.StartDisableUndo
Increments an internal counter that determines if the undo mechanism is disabled.
As the count goes from 0 to 1 Undo is disabled. Should be used with a matched call
to EndDisableUndo.

Autodesk.Navisworks.Api.Document.SuggestedFileName
Suggested file name which document could be saved to. Always a valid filename
(absolute if file already exists, relative if suggested name for new file).

Autodesk.Navisworks.Api.Document.Takeoff
Gets the associated DocumentTakeoff part as discoverable IDocumentTakeoff

Autodesk.Navisworks.Api.Document.Timeliner
Gets the associated DocumentTimeliner part as discoverable IDocumentTimeliner

Autodesk.Navisworks.Api.Document.Title
Title for document. Suitable for display in window title bar, or similar.

Autodesk.Navisworks.Api.Document.Tool
Gets a DocumentTool object containing the
active Tool.

Autodesk.Navisworks.Api.Document.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.Document.TransactionBeginning
Occurs when a Transaction (multiple batched edits) begins, before any of the edits
in the transaction take place.

Autodesk.Navisworks.Api.Document.TransactionEnded
Occurs when a Transaction (multiple batched edits) has ended and all
the edits have been completed or rolled back.

Autodesk.Navisworks.Api.Document.TryAppendFile(System.String)
Try to append file with files already in document, adding to current contents.
fileName: Path to try and append file from
Returns: false if append fails

Autodesk.Navisworks.Api.Document.TryAppendFiles(System.Collections.Generic.IEnumerable{System.String})
Try to append files with files already in document, adding to current contents. More efficient than
appending each file separately.
fileNames: Paths to append files from
Returns: false if append fails

Autodesk.Navisworks.Api.Document.TryAppendSheet(Autodesk.Navisworks.Api.SheetInfo)
Try to append contents of sheet to current active sheet.
sheet: SheetInfo to try and append sheet from
Returns: false if append fails

Autodesk.Navisworks.Api.Document.TryCloseFileHandles
Try to close all file handles for currently loaded files, completing load for current sheet.
File handles may be reopened in future (e.g. when changing the active sheet).
Returns: false if load cannot be completed or file handles cannot be closed

Autodesk.Navisworks.Api.Document.TryConvertSheet(System.String)
Try to Convert sheet with sheetId.
sheetId: Id of sheet to try to convert
Returns: false if sheet could not be converted
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.TryDescribeAsAggregate(System.String@)
Describes current contents in terms of an JSON AggregateModelDefinition object.
Returns:
false if current contents cannot be described as an aggregate.

Autodesk.Navisworks.Api.Document.TryExportToNwd(System.String,Autodesk.Navisworks.Api.NwdExportOptions)
Exports contents of document to an NWD file..
fileName: Path to try and publish file to
options: Options to export file with
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.TryMergeFile(System.String)
Try to merge file into document, merging with current contents, ignoring duplicates.
fileName: Path to try and merge file from
Returns: false if merge fails

Autodesk.Navisworks.Api.Document.TryMergeFiles(System.Collections.Generic.IEnumerable{System.String})
Try to merge files with files already in document, merging with current contents. More efficient than
merging each file separately.
fileNames: Paths to merge files from
Returns: false if merge fails

Autodesk.Navisworks.Api.Document.TryMergeSheet(Autodesk.Navisworks.Api.SheetInfo)
Try to merge contents of sheet to current active sheet, ignoring duplicates.
sheet: SheetInfo to try and merge sheet from
Returns: false if merge fails

Autodesk.Navisworks.Api.Document.TryOpenAggregate(System.String,System.String)
Try to load aggregate into document, replacing current contents..
aggregateJson: Aggregate in the form of a JSON AggregateModelDefinition object.
Returns: false if load fails

Autodesk.Navisworks.Api.Document.TryOpenFile(System.String)
Try to load file into document, replacing current contents.
fileName: Path to try and load file from
Returns: false if load fails

Autodesk.Navisworks.Api.Document.TryPublishFile(System.String,Autodesk.Navisworks.Api.NwdExportOptions,Autodesk.Navisworks.Api.PublishProperties)
Try to publish contents of document to a file.
fileName: Path to try and publish file to
properties: Publishing properties to publish file with
Returns: false if publish fails
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.TryRedo
Tries to redo the last completed transaction and make it available for Undo again.
Returns: False if nothing can be redone or there is an active transaction in progress

Autodesk.Navisworks.Api.Document.TryRemoveFile(System.Int32)
Try to remove the file with the provided index from the document.
index: Index of the file to remove from the document
Returns: false if the file could not be removed

Autodesk.Navisworks.Api.Document.TryRollback
Tries to roll back (undo) the last completed transaction and make it available for Redo.
Returns: False if nothing can be undone or there is an active transaction in progress

Autodesk.Navisworks.Api.Document.TrySaveFile(System.String)
Try to save contents of document to a file.
fileName: Path to try and save file to
Returns: false if save fails
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.TrySaveFile(System.String,Autodesk.Navisworks.Api.DocumentFileVersion)
Try to save contents of document to a file using a specific file version.
fileName: Path to try and save file to
Returns: false if save fails
Throws System.InvalidOperationException:
Document IsClear
Throws System.ArgumentException:
fileName does not have .nwd or .nwf extension

Autodesk.Navisworks.Api.Document.TrySetActiveSheet(System.String)
Try to switch to the sheet with Id sheetId.
sheetId: Id of sheet to make active
Returns: false if sheet could not be made active
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.TryUndo
Tries to undo the last completed transaction and make it available for Redo.
Returns: False if nothing can be undone or there is an active transaction in progress

Autodesk.Navisworks.Api.Document.Undo
Undoes the last completed transaction and makes it available for Redo.
Throws System.InvalidOperationException:
No transaction is available to Undo or there is an active transaction in progress.

Autodesk.Navisworks.Api.Document.Units
Units for document. Apply to all geometry, properties, transforms, viewpoints, etc. in the document.

Autodesk.Navisworks.Api.Document.UnitsChanged
Occurs when the units of the Document are changed.

Autodesk.Navisworks.Api.Document.UpdateFiles
Updates loaded files to match files on disk (i.e. if file has been changed
since it was first loaded).
Returns: true if anything in document was updated

Autodesk.Navisworks.Api.Document.UpVector
Natural up vector for this model. Will be Zero if no up vector defined.

Autodesk.Navisworks.Api.Document.ViewAdded
Occurs when a View has been added to the Views
collection. Typically soon after the View has been created.

Autodesk.Navisworks.Api.Document.ViewRemoved
Occurs when a View has been removed from the Views
collection. Typically shortly before the View is destroyed.

Autodesk.Navisworks.Api.Document.Views
Gets a ReadOnlyCollection object
containing the current list of Views of the Document.